{
  "https://www.nhs.uk/conditions/head-injury-and-concussion": {
    "last_checked": "2026-01-29T17:40:17.803817",
    "hash": "204f3caed8b0f85d31a19ebf9244c80f8717aa3237efda4c0d4f3ff8c58c5b4e",
    "text": "﻿ Head injury and concussion - NHS Skip to main content Search the NHS website Search Head injury and concussion Most head injuries are not serious, but it's important to get medical help if you or your child have any symptoms after a head injury. You might have concussion (temporary brain injury) that can last a few weeks. Immediate action required: Go to A&E if: You or your child have had a head injury and: have a bruise, swelling or cut that's larger than 5cm on their head you have an open wound on your head you've been knocked out but have now woken up you've vomited (been sick) since the injury you have a headache that does not go away you notice a change in behaviour, like being more irritable, losing interest in things around you or being easily distracted (especially in children under ) your child has been crying more than usual (especially in babies and young children) you have problems with memory you've been drinking alcohol or taking drugs just before the injury you have a blood clotting disorder (like haemophilia) or you take medicine to help prevent blood clots you've had brain surgery in the past Symptoms sometimes do not appear until a few days or weeks later. Also go to A&E if you think someone has been injured intentionally. Find your nearest A&E Immediate action required: Call  if: Someone has hit their head and has: been knocked out and has not woken up difficulty staying awake or keeping their eyes open a fit (seizure) fallen from a height more than  metre or  stairs problems with their vision or hearing a black eye without direct injury to the eye clear fluid coming from their ears or nose bleeding from their ears or bruising behind their ears numbness or weakness in part of their body problems with walking, balance, understanding, speaking or writing hit their head at speed, such as in a car crash, being hit by a car or bike or a diving accident a head wound with something inside it or a dent to the head Also call  if you cannot get someone to A&E safely. Information: Do not drive to A&E. The person you speak to at  will give you advice about what to do. Important: Help from NHS  If you're not sure what to do or are worried about a head injury, call  or get help from  online . NHS  can tell you the right place to get help. How to care for a minor head injury If you have been sent home from hospital with a minor head injury, or you do not need to go to hospital, you can usually look after yourself or your child at home. You might have symptoms of concussion, such as a slight headache or feeling sick or dazed, for up to  weeks. Do hold an ice pack (or a bag of frozen peas) wrapped in a tea towel to the area regularly for short periods in the first few days to bring down any swelling rest and avoid stress – you or your child do not need to stay awake if you're tired take painkillers such as paracetamol for headaches make sure an adult stays with you or your child for at least the first  hours Don’t do not go back to work or school until you're feeling better do not drive until you feel you have fully recovered do not play contact sports for at least  weeks – children should avoid rough play for a few days do not take drugs do not drink alcohol until you're feeling better do not take sleeping pills while you're recovering unless a doctor advises you to Non-urgent advice: See a GP if: You or your child have a head injury and: the symptoms last more than  weeks you're not sure if it's safe for you to drive or return to work, school or sports Page last reviewed:  May  Next review due:  May",
    "http_status": 200
  },
  "https://www.nhs.uk/live-well/exercise/flexibility-exercises": {
    "last_checked": "2026-01-29T17:40:18.286430",
    "hash": "ea9d08258c5a3e5a479fa6d88a5da61805b27d05b16dc9a5e0a38ac40562b7e4",
    "text": "﻿ Flexibility exercises - NHS Skip to main content Search the NHS website Search Flexibility exercises These flexibility exercises can be done at home to help improve your health and mobility. Do not worry if you have not done much exercise for a while, the exercises are gentle and easy to follow. Wear loose, comfortable clothing and keep some water handy. Build up slowly and aim to gradually increase the repetitions of each exercise over time. Try to do these exercises at least twice a week and combine them with the other routines in this series: sitting exercises balance exercises strength exercises Neck rotation Improves neck mobility and flexibility. A. Sit upright with shoulders down. Look straight ahead. B. Slowly turn your head towards your left shoulder as far as is comfortable. Hold for  seconds and return to the starting position. C. Repeat on the right. Do  rotations on each side. Neck stretch Good for loosening tight neck muscles. A. Sitting upright, look straight ahead and hold your left shoulder down with your right hand. B. Slowly tilt your head to the right while holding your shoulder down. C. Repeat on the opposite side. Hold each stretch for  seconds and repeat  times on each side. Sideways bend Helps restore flexibility to the lower back. A. Stand upright with your feet hip-width apart and arms by your sides. B. Slide your left arm down your side as far as is comfortable. As you lower your arm, you should feel a stretch on the opposite hip. C. Repeat with your right arm. Hold each stretch for  seconds and perform  on each side. Calf stretch Good for loosening tight calf muscles. A. Place your hands against a wall for stability. Bend the right leg and step the left leg back at least a foot's distance, keeping it straight. Both feet should be flat on the floor. B. The left calf muscle is stretched by keeping the left leg as straight as possible and the left heel on the floor. C. Repeat with the opposite leg. Perform  on each side. Page last reviewed:  November  Next review due:  November",
    "http_status": 200
  },
  "https://www.nhs.uk/conditions/neck-pain-and-stiff-neck": {
    "last_checked": "2026-01-29T17:40:18.834639",
    "hash": "2280460618b2d67e13386b52b373e24c5547297c8c42413f4900050fc329e432",
    "text": "﻿ Neck pain - NHS Skip to main content Search the NHS website Search Neck pain Most neck pain only lasts a few weeks. There are things you can do yourself to ease it, but see a GP if it does not go away. How you can ease neck pain yourself Do take paracetamol or ibuprofen – or use ibuprofen gel on your neck use a low, firm pillow put heat or cold packs on your neck try neck flexibility exercises Don’t do not wear a neck collar – it's better to keep your neck moving (unless a doctor tells you not to) do not do anything that could be dangerous because you cannot move your neck – for example, driving or cycling Putting heat or cold packs on your neck Try either of these: a pack of frozen peas wrapped in a tea towel for  minutes,  times a day a hot water bottle wrapped in a tea towel for  minutes,  to  times a day You can also buy heat or cold packs from a pharmacy. Non-urgent advice: See a GP if: neck pain or stiffness does not go away after a few weeks painkillers like paracetamol or ibuprofen have not worked you're worried about the pain you have other symptoms, like pins and needles or a cold arm – this could be something more serious What can cause neck pain The most common causes of neck pain are: the neck becoming locked in an awkward position while sleeping bad posture – for example, when sitting at a desk for a long time a pinched nerve an injury – for example, whiplash from a traffic accident or fall How you can prevent neck pain Do when sleeping, make sure your head is the same height as the rest of your body have a firm mattress sit upright – roll your shoulders back gently and bring your neck back Don’t do not keep your neck in the same position for a long time – for example, when sitting at a desk do not sleep on your front do not twist your neck when you're in bed Information: Self-refer for treatment If you have neck pain, you might be able to refer yourself directly to services for help with your condition without seeing a GP. To find out if there are any services in your area: ask the reception staff at your GP surgery check your GP surgery's website contact your integrated care board (ICB) – find your local ICB search online for NHS treatment for neck pain near you Page last reviewed:  April  Next review due:  April",
    "http_status": 200
  },
  "https://www.nhs.uk/conditions/whiplash": {
    "last_checked": "2026-01-29T17:40:19.204307",
    "hash": "9616c52422bc632aa5ea6094552cdc3bbd88b13d2989cffaaa6ed30dd1879b59",
    "text": "﻿ Whiplash - NHS Skip to main content Search the NHS website Search Whiplash Whiplash is a neck injury caused by sudden movement of the head. It usually gets better within  to  months. Symptoms of whiplash Whiplash most often happens after a traffic accident or a slip or fall. Common symptoms of whiplash include: neck pain neck stiffness and difficulty moving your head headaches pain and muscle spasms in the shoulders and arms It can take several hours for the symptoms to start after you injure your neck. Things you can do to treat whiplash There are some things you can do to treat whiplash. Do take painkillers, such as paracetamol or ibuprofen , to help with pain try to continue doing everyday activities – it might hurt a little but it will speed up your recovery Don’t do not use a neck brace or collar to support your neck – this does not help do not rest your neck for long periods of time Urgent advice: Ask for an urgent GP appointment or get help from NHS  if: You have injured your neck and: you have severe pain despite taking paracetamol or ibuprofen you have tingling or pins and needles on  or both sides of your body you have problems with walking or sitting upright you have a sudden \"electric shock\" feeling in your neck and back which may also go into your arms and legs your arms or legs feel weak These symptoms could be caused by damage to the nerves in your neck or back. You can call  or check your symptoms on  online . What we mean by severe pain Severe pain: always there and so bad it's hard to think or talk you cannot sleep it's very hard to move, get out of bed, go to the bathroom, wash or dress Moderate pain: always there makes it hard to concentrate or sleep you can manage to get up, wash or dress Mild pain: comes and goes is annoying but does not stop you doing daily activities Treatment for whiplash A GP may prescribe a stronger painkiller such as codeine for whiplash. If your symptoms do not get any better after a few weeks, a GP may refer you: to a physiotherapist to a pain specialist for psychological support Physiotherapy from the NHS may not be available in your area and waiting times can be long. You can also get physiotherapy privately. Find a physiotherapist service Page last reviewed:  January  Next review due:  January",
    "http_status": 200
  },
  "https://www.nhs.uk/conditions/cuts-and-grazes": {
    "last_checked": "2026-01-29T17:40:19.647648",
    "hash": "9d5ae5f49b105f4f901675399992dd350adda9aad7d3af034a023b98a37b993c",
    "text": "﻿ Cuts and grazes - NHS Skip to main content Search the NHS website Search Cuts and grazes Most cuts and grazes can be treated at home and will start to heal in a few days. But some wounds may need to be treated by a medical professional if there's a risk of infection or the cut is serious. How to treat a cut or graze yourself You can treat a cut or graze yourself by stopping any bleeding, cleaning the wound, and covering it with a plaster or dressing. This will help stop it getting infected. If it's painful, you can take painkillers such as paracetamol or ibuprofen (but do not give aspirin to children under ). What to do if the wound is bleeding a lot Check the wound and make sure there's nothing stuck in it. If there's nothing in the wound, put pressure on it using a bandage or a clean, folded cloth (such as a tea towel) for  minutes. If there's something stuck in the wound, do not try to take it out. Make sure not to press down on the object. Press firmly either side of it to push the edges of the wound together. If the wound is on your hand or arm, raise it above your head. If the wound is on your lower limb, lie down and raise it above the level of your heart. This will help reduce the blood flow. When the bleeding has stopped, firmly wrap a new bandage over the first cloth or bandage. If the wound keeps bleeding, leave the first bandage in place and add another one. Keep pressing firmly on the wound for another  minutes. How to clean and dress a cut or graze If the bleeding has stopped, you can clean a small wound and then put a plaster or dressing over it. Wash your hands thoroughly and dry them. Put on disposable gloves if you have some. Clean the wound by rinsing it with bottled or tap water, or by using sterile wipes. Clean the skin around the wound using soap and water or antiseptic – but try not to get antiseptic into the wound. Pat the area dry using a gauze swab or a clean tea towel. Put on a sterile dressing or a plaster. Keep the dressing clean by changing it as often as you need. You can take it off after a few days, once the wound has closed. Information: Find out more How to apply plasters and other dressings How to apply a bandage Urgent advice: Ask for an urgent GP appointment or get help from NHS  if: a wound has soil, pus or body fluids in it, or it's still dirty after cleaning it you were bitten by a person or a wild or stray animal a cut is swollen, red and getting more painful or pus is coming out of it a cut is larger than around 5cm ( inches) you've cut yourself and also feel generally unwell or have a high temperature You can call  or get help from  online . Immediate action required: Call  or go to A&E if: you have a cut and cannot stop the bleeding the blood comes out in spurts and is bright red and hard to control you lose feeling near the wound or have trouble moving it you have a bad cut on your face or the palm of your hand the wound is very large or deep there's something stuck in the cut, such as a shard of glass – do not try to take it out yourself Find your nearest A&E Information: Do not drive to A&E. Ask someone to drive you or call  and ask for an ambulance. Bring any medicines you take with you. Treatments for cuts and grazes How a cut or graze is treated will depend on how bad it is and if there's a risk of it becoming infected. The cut will be cleaned and closed with either stitches, strips or special glue before a dressing is put over it. But the wound may not be closed straight away if it's infected or there's a risk it may get infected. You may also need to have an injection to prevent tetanus or be given antibiotics if the cut could be infected. Page last reviewed:  June  Next review due:  June",
    "http_status": 200
  },
  "https://www.nhs.uk/common-health-questions/accidents-first-aid-and-treatments/how-do-i-care-for-a-wound-treated-with-skin-glue": {
    "last_checked": "2026-01-29T17:40:20.081488",
    "hash": "efcb3ad7e5117796850a04045cd08beae42e939e561ebece16ab004566eca2d3",
    "text": "﻿ Having an operation (surgery) - NHS Skip to main content Search the NHS website Search Overview - Having an operation (surgery) If you're considering having an operation or your GP has suggested you may need surgery, this guide is for you. It'll take you through all the steps in the process, from referral to recovery, so you're fully prepared and know what questions to ask at each stage. Before you start, you'll need to decide which hospital you'd like to be referred to. Find out about NHS hospital services and choosing a hospital . Once you have chosen your hospital, in most cases your GP will refer you to see a specialist at this hospital. Page last reviewed:  July  Next review due:  July",
    "http_status": 200
  },
  "https://www.bbc.co.uk/news/live/cjdjgy74l1jt": {
    "last_checked": "2026-01-29T17:40:20.431624",
    "hash": "c8c7abf4cb34df651087abc005e528c20236af750e9e969b9278629f33d1fd36",
    "text": "Live: Tom Homan says Minnesota operation will be 'safer, by the book' - BBC News BBC News Summary Donald Trump's \"border tsar\" Tom Homan says he is working on making ICE operations in Minneapolis \"safer, more efficient, by the book\" In a news conference that was light on details, he says he wants \"common sense co-operation that allows us to draw down on the number of people we have here\" And - while he says ICE and Border Patrol officers are working in a \"challenging environment\" - he insists unprofessional behaviour will \"be dealt with\" President Trump sent Homan to the city after two protesters, Renee Good and Alex Pretti, were shot dead by federal officials in Minneapolis The White House says Homan will now be the \"main point of contact on the ground\" Homan is taking over from US Border Patrol chief Greg Bovino who, alongside Homeland Security Secretary Kristi Noem, has been criticised for ICE operations - and comments made after Alex Pretti was killed Media caption, Watch: How Alex Pretti shooting led Trump to shift course in Minneapolis Live Reporting Edited by Brandon Livesay, Caitlin Wilson and Emily Atkinson Democrats and some Republicans block government funding as another shutdown looms published at  GMT  GMT Breaking A package that would have kept the US federal government funded has not made it through its first hurdle in the US Senate, with Democrats demanding changes linked to their concerns over the Trump administration's immigration crackdown. The final tally was  yes votes to  no votes , with Republicans failing to reach the -vote threshold needed for the bill to move forward. Several Republicans joined the Democrats in voting no on the bill, including Senate Majority Leader John Thune. A government shutdown could begin at one minute after midnight on Friday if lawmakers cannot agree on a solution. Negotiations to agree on a funding plan will continue between now and then. If a shutdown does happen, it would be the second within only a few months. But this time it would only be a partial shutdown, as legislation has already been passed to fund dozens of agencies through September. Democrats in the Senate have been sparring with Republicans over the bill - pushing to remove funding for the Department of Homeland Security (DHS) following the fatal shooting of Alex Pretti by federal agents in Minneapolis. Share close panel Share page Copy link About sharing 'We'll work in a bipartisan way not to have a shutdown', Trump tells cabinet published at  GMT  GMT Image source, Getty Images During his cabinet meeting, Donald Trump takes a moment to reference a possible government shutdown. Democrats have been pushing to remove funding for the Department of Homeland Security (DHS) from a $.2tn (Â£870bn) government spending package following the fatal shooting of Alex Pretti in Minneapolis on Saturday. Referencing achievements on economic growth, Trump tells his cabinet: \"Hopefully we won't have a shutdown, we're working on that right now. The Democrats, I don't believe, want to see it either.\" \"We'll work in a very bipartisan way not to have a shutdown,\" he adds. While we hear from Trump, we're also keeping an eye on the Senate floor, where the potential government shutdown is under discussion. We'll bring you any developments from there as we get them. Share close panel Share page Copy link About sharing Top Senate Dem says change is needed to rein in ICE agent 'thugs' published at  GMT  GMT Image source, Getty Images Top Senate Democrat Chuck Schumer just spoke about Minneapolis on the floor of the US Senate. He says Democrats are willing to fund % of the government - but emphasises demands they have for changes to ICE operations that must be added first. He highlights three: End the roving patrols Enforce accountability Masks off, body cams on Schumer calls the killing of Alex Pretti a \"moral abomination\" as he describes ICE agents as \"thugs\". \"What ICE is doing outside the law is state sanctioned thuggery,\" he says. \"Congress has the authority and the moral obligation to act.\" He says Democrats are \"ready to come to the table\" and the Senate's Republican majority needs to \"step up to the plate\" and implement common sense reforms. \"Change is needed,\" he says. \"It does not look like America, these pictures, and it's been unleashed by Donald Trump and the people under him.\" Share close panel Share page Copy link About sharing Cabinet meeting with Trump begins published at  GMT  GMT US President Donald Trump is now holding his first cabinet meeting of the year in the White House. We're monitoring the meeting and we'll bring you any top lines on this page. Share close panel Share page Copy link About sharing Is Trumpâ\u0080\u0099s border tsar right about illegal migrants and public safety? published at  GMT  GMT Lucy Gilder BBC Verify journalist During his Minneapolis news conference earlier, US border tsar Tom Homan said the Trump administration â\u0080\u009chas absolutely focused on identifying removable aliens that pose a public safety threat and national security threatsâ\u0080\u009d. â\u0080\u009cThe numbers prove it, the data proves it,â\u0080\u009d he added. US Immigration and Customs Enforcement , external , external (ICE) , external publishes figures , external on the number of detained illegal migrants by security level. A detaineeâ\u0080\u0099s security risk is based on public safety factors such as previous criminal convictions, disciplinary record and other management concerns. There are four categories of security risk: A=low, B=medium low, C=medium high and D=high. At the end of December, more than half of the nearly , ICE detainees at that time were classified as low security risks (A). The highest security category (D) had the lowest number of detainees at ,. The same data shows half of detainees around that time had a criminal charge or conviction. Share close panel Share page Copy link About sharing Judge orders Trump administration to stop detaining Minnesota's refugees published at  GMT  GMT Brandon Drenon BBC News A federal judge issued a temporary restraining order against the Trump administration on Wednesday, barring them from arresting and detaining legally admitted refugees in Minnesota without a warrant. In his ruling, Judge John Tunheim said \"they are not committing crimes on our streets, nor did they illegally cross the border\", adding that the refugees have a legal \"right not to be subjected to the terror\" of the current immigration enforcement. In January, the Trump administration announced the launch of Operation PARRIS which was meant to target and re-examine the legal status of Minnesota's , refugees who have not secured permanent legal status. Since then, the federal government has \"subjected more than  refugees, including children, in Minnesota to unlawful arrests, detentions and interrogations\", according to the criminal complaint. \"Some were subjected to intense questioning, while others have remained imprisoned for over a week, many shuffled between facilities in shackles,\" according to a statement from the International Refugee Assistant Project (IRAP), one of the participants in the lawsuit. Kimberly Grano, a lawyer from IRAP, says the Trump administration's immigration crackdown is \"a campaign of terror to try to strike fear into these communities\". Grano tells the BBC that some of the refugees detained were in the process of obtaining their legal permanent resident status, but that has been frozen since the government stopped processing most green card applications last year. \"These people are being arrested even if they have submitted a green card application, and the government is just choosing not to decide it,\" Grano says. Share close panel Share page Copy link About sharing US Senator Amy Klobuchar announces she is running for Minnesota Governor published at  GMT  GMT Image source, Getty Images Image caption, Senator Amy Klobuchar US Senator Amy Klobuchar has announced her bid to become governor of Minnesota. The state has been catapulted into the spotlight over the Trump administration's aggressive immigration crackdown, which this month saw two US citizens shot dead by ICE agents - prompting widespread international scrutiny. Klobuchar's campaign comes after the incumbent governor, Tim Walz, announced he would end his re-election campaign, amid criticism of his handling of a fraud scandal in the state. â\u0080\u009cMinnesota, weâ\u0080\u0099ve been through a lot,â\u0080\u009d says Klobuchar in a four-minute video address posted on X where she takes aim at the Trump administration as one that \"relishes division\", citing the increase of political violence in the state, as well as the deadly shootings of Renee Good and Alex Pretti by ICE agents. Announcing her candidacy, Klobuchar pledges to be a \"transformative governor\" who will \"protect the people of our state - all of them\" and \"stand up for what's right\". \"I'm running for every Minnesotan who wants ICE and it's abusive tactics out of the state we love,\" she adds. Share close panel Share page Copy link About sharing Another possible government shutdown looms after Minneapolis shooting published at  GMT  GMT Bernd Debusmann Jr Reporting from Washington DC Today's cabinet meeting comes as the threat of another US government shutdown looms, with lawmakers reportedly engaging in negotiations about Trump's immigration enforcement action. US media report that the White House and Senate Democratic leadership are nearing an agreement which would meet Democratic demands to introduce new restrictions on federal immigration agents. If no deal is struck, the second shutdown within months will begin at one minute after midnight on Friday,  January. The spending bill has already passed in the House of Representatives, but needs  Senate votes to advance. Among the changes Democrats are seeking are requirements that federal agents obtain warrants before making arrests and clearer rules governing how they identify themselves, according to US media reports. There are only  Republican senators in the -member body, meaning that passing the bill will require at least some support from Democratic members. Earlier this week, Senate Minority Leader Chuck Schumer said: \"I will vote no on any legislation that funds ICE until it is reined in and overhauled, and Senate Democrats are overwhelmingly united on this issue.\" Republican Senate Majority Leader John Thune has said that \"productive\" negotiations are ongoing. If changes are made, the bill will need to be re-approved by the House, which is currently on recess. On Wednesday, some Senate Democrats escalated their demands, expressly calling for DHS Secretary Kristi Noem's removal, and structural changes to both Immigration and Customs Enforcement (ICE) and US Border Patrol. \"This madness,\" Schumer said, \"this terror must stop.\" You can read more about the details of the spending bill here Share close panel Share page Copy link About sharing Trump to hold cabinet meeting published at  GMT  GMT Image source, EPA Image caption, Trump has admitted he's not overly fond of cabinet meetings In the next  minutes or so, we're expecting to hear from US President Donald Trump, who's due to kick off the first cabinet meeting of the year from  ET ( GMT). Typically, Trump goes around the room and asks each government department leader to speak. We don't know if ICE or Minnesota are on the agenda. â\u0080\u009cItâ\u0080\u0099s boring as hell,â\u0080\u009d Trump previously said when discussing cabinet meetings with New York Magazine. These gatherings typically last for a few hours, but we'll make sure to follow along and bring you any key lines. Share close panel Share page Copy link About sharing Tom Homan. the 'border tsar' in charge of de-escalating tensions in Minnesota published at  GMT  GMT Image source, Reuters Image caption, White House border czar Tom Homan speaks during a press conference in Minneapolis on Thursday 'Border tsar' Tom Homan's arrival in Minneapolis comes as the White House seeks to de-escalate tensions in Minnesota. Through the years, the -year-old has climbed through the ranks of US immigration enforcement - and has worked with both Democratic and Republican administrations. In , he was appointed to a little-known but influential post under Barack Obama where he headed the Enforcement and Removals Operations arm of ICE. He was called out of plans to retire twice, in  just days before Trump's first administration began, and again after Trump's re-election in . Homan has been a vocal defender of Trump's deportation goals, vowing to target the \"worst of the worst\" and has been a staunch defender of his highly contentious family separation policy - which led to children being separated from their parents who were in the country illegally. Last year, the White House swiftly came to Homan's defence after reports emerged that he had been accused in a bribery case of accepting $, (Â£,) from undercover agents. The case was ultimately dropped by the justice department when Trump returned to office, with White House Press Secretary Karoline Leavitt describing that case as an effort to \"entrap\" a key Trump ally. Share close panel Share page Copy link About sharing In pictures: Minneapolis community mourns Alex Pretti published at  GMT  GMT Tributes to Alex Pretti, who was fatally shot by federal immigration officers on  January, are still growing nearly a week after his death. People gathered for a vigil for Pretti near where he was killed in Minneapolis, with members of the community laying flowers around a large portrait of the -year-old. Minnesota Governor Tim Walz visited a memorial site for Pretti on Wednesday and promised his parents he would \"continue to tell his story\". Image source, Reuters Image caption, A portrait is displayed during a vigil in Minneapolis on Wednesday Image source, Reuters Image source, Reuters Image source, Reuters Image caption, People gather during a vigil for Alex Pretti in Minneapolis on Wednesday Share close panel Share page Copy link About sharing ICE 'ends enhanced activities' in Maine, senator confirms published at  GMT  GMT Image source, Getty Images Immigration and Customs Enforcement (ICE) has \"ended its enhanced activities in the state of Maine\", according to US Senator Susan Collins. A few days ago, the Republican senator wrote to US Homeland Security Secretary Kristi Noem asking her to pause ICE operations in Maine and Minnesota after the death of protester Alex Pretti. Now, writing on social media, she says an end to activities in Maine has been confirmed by Noem. \"There are currently no ongoing or planned large-scale ICE operations here,\" Collins says. \"I appreciate the Secretary's willingness to listen to and consider my recommendations and her personal attention to the situation in Maine.\" Share close panel Share page Copy link About sharing Congressman says detained five-year-old 'did not look well' published at  GMT  GMT In addition to the shootings of Renee Good and Alex Pretti, ICE has been facing criticism for detaining five-year-old Liam Ramos and his father Adrian Alexander Conejo Arias. The pair were detained in Minnesota last week , and are currently being held in a Texan detention centre. Writing on X, Congressman Joaquin Castro says that \"Liam did not look well\" when he visited him yesterday. Castro says that he has put in a request to visit the five-year-old again, adding that \"my staff and I are very concerned about him\". The congressman was one of several lawmakers that visited the facility on Wednesday, speaking out against the father and son's detention, and urging the Trump administration to release them. The Department of Homeland Security has said the pair entered the US illegally, while a lawyer for the family said they followed proper protocols to seek asylum. Share close panel Share page Copy link About sharing US border tsar: 'I came here to seek solutions' published at  GMT  GMT Media caption, US border tsar: 'I came here to seek solutions' After taking over the immigration operation in Minnesota three days ago, White House border tsar Tom Homan now says he is working with local leaders and law enforcement to mitigate problems the state has had in recent weeks. \"We didn't agree on everything, we didn't expect to agree on everything,\" he has said, but added: \"I came here to seek solutions.\" Share close panel Share page Copy link About sharing Homan seen as a steady figure for the White House published at  GMT  GMT Bernd Debusmann Jr Reporting from Washington DC Image source, Getty Images Image caption, Homan is considered a close ally of President Trump and a vocal defender of his deportation goals Some in Washington are likely to hear Homan's remarks as a subtle repudiation of the aggressive tactics that characterised Greg Bovino's tenure in Minneapolis - and more broadly that of Department of Homeland Security Secretary Kristi Noem. The \"targeted\" operations he was referring to are direct ones, aimed at specific individuals, rather than mass sweeps aimed at nobody in particular. That isn't to say that Homan is a moderate. He is, however, seen by people close to the Trump administration as someone who can work with state and local officials to prioritise public safety threats, and, the White House hopes, lower the public temperature. In his frequent appearances at the White House since the beginning of the administration, Homan has repeatedly said that any undocumented migrants caught up in \"targeted enforcement\" will also be processed for immigration violations. He repeated that again today, a fact which is unlikely to endear him to activists or immigration advocates, many of whom vividly remember his previous stance on family operations. For the White House, however, his presence in Minneapolis will be seen as a steady, experienced hand coming to solve both a law enforcement issue and a public relations one. Share close panel Share page Copy link About sharing What have we just heard from Tom Homan? published at  GMT  GMT In the last hour, Donald Trump's border tsar Tom Homan hosted his first press conference since taking over immigration enforcement operations in Minneapolis. If you're only just joining us, here are the key lines from his update: Homan says his task is to \"regain law and order\" in Minneapolis and work to \"remove threats from the community\". He also says he will stay in the city \"until the problem is gone\" The border tsar says immigration enforcement operations will now focus on those who pose a risk to public safety with a more \"targeted\" approach He also says there will be a \"draw-down\" of operations in Minnesota - but doesn't provide a clear timetable of when that might happen The withdrawal of immigration enforcers is \"dependant on cooperation\" from local officials, Homan adds Asked about the shootings of Renee Good and Alex Pretti earlier this month, Homan says he will let the investigations play out. He adds that Trump has told him that he \"doesn't want to see anybody die\" The border tsar calls for a departure from \"dangerous rhetoric\" as he pledges that any agent who doesn't abide by codes of conduct will be 'dealt with' Share close panel Share page Copy link About sharing Border tsar says there'll be a 'draw-down' of operations in Minnesota - but doesn't say when published at  GMT  GMT Daniel Bush Washington Correspondent Image source, Reuters White House border tsar Tom Homan promises that the administration will make changes in the immigration operation underway in Minneapolis. But Homan says the speed of a \"draw-down\" of federal forces in the city would depend on the cooperation of state and local officials, adding that the Trump administration's larger immigration enforcement mission would continue. \"You're going to see a draw-down,\" Homan says, speaking at a press conference in Minnesota. He did not provide details on how many federal forces might leave the city, or when. Homan also defends President Donald Trump's immigration policies, and says that \"targeted\" enforcement aimed at removing undocumented immigrants would continue throughout the country. \"We are not going to surrender our mission at all, we're just going to do it smarter,\" Homan says. Homan's remarks underscored the administration's efforts in recent days to calm tensions in Minneapolis after federal agents fatally shot two US citizens in the city in recent weeks. At the same time, Homan - who was sent to Minneapolis this week by Trump to oversee the operation there - appeared focused on sending a message that the administration did not plan to back down on one of Trump effort to deport millions of undocumented migrants from the US. Share close panel Share page Copy link About sharing Homan says he won't make any comments on Minnesota shootings published at  GMT  GMT Homan is now asked about the new footage that has emerged of Alex Pretti . The video shows an altercation between Pretti and federal officers  days before his death. A spokesperson for the Pretti family has confirmed the man in the video is the ICU nurse, with the familyâ\u0080\u0099s lawyer adding that \"nothing that happened a full week before could possibly have justified Alex's killing\". Homan says he will not comment \"on any shootings\". \"We'll let the investigation play out and let it go where it goes,\" he says. \"I'm not going to come out and make any comments whether I think it's right or wrong.\" Homan says Trump has told him that he \"doesn't want to see anybody die\", adding that this includes people that federal immigration agents are looking for. He reiterates that he wants ICE agents to operate \"in the safety and security\" of jails rather than on the street. And that brings an end to Trump's border tsar's first news conference since his arrival in Minnesota. Share close panel Share page Copy link About sharing Homan not saying how many ICE, CBP officers in Minnesota published at  GMT  GMT Image source, Reuters Homan is now asked to be specific about how many ICE and border patrol agents are operating in Minnesota. Homan does not give a figure. Instead, he says there's been some rotations, which happen \"all the time\". \"My main focus now is draw down,\" he tells the press. Share close panel Share page Copy link About sharing 'No one is off the table' in targeted immigration operations published at  GMT  GMT Homan is asked about people ICE agents are looking for and if they will target those simply for being undocumented. He says criminality is the main focus, and that anyone who has come here illegally has committed a crime. He adds that \"no one is off the table\" in targeted immigration operations. Allowing undocumented immigrants in and letting them go through due process later is \"sending the wrong message\". The Trump administration, Homeland Security and ICE are working hard to combat national security threats. Share close panel Share page Copy link About sharing",
    "http_status": 200
  }
}